{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "title",
    "1": "creator",
    "2": "subject",
    "3": "description",
    "4": "publisher",
    "5": "date",
    "6": "type",
    "7": "format",
    "8": "identifier",
    "9": "source",
    "10": "language",
    "11": "relation",
    "12": "rights",
    "13": "contributor",
    "14": "coverage"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "contributor": 13,
    "coverage": 14,
    "creator": 1,
    "date": 5,
    "description": 3,
    "format": 7,
    "identifier": 8,
    "language": 10,
    "publisher": 4,
    "relation": 11,
    "rights": 12,
    "source": 9,
    "subject": 2,
    "title": 0,
    "type": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
